blueskycoco/rtt/bsp/tm4c129x/applications/con_common.c
		}
		break;
		case 8:
		case 9:
		case 10:
		case 11:
		{
			//set remote ipv4 ip
			
		}
		break;
		case 12:
		case 13:			
		case 14:
		case 15:
		{
			//set remote ipv6 ip
			
		}
		break;
		case 16:
		case 17:
		case 18:
		case 19:
		{
			//set remote port
			
		}
		break;
		case 20:
		case 21:
		case 22:
		case 23:
		{
			//set net protol
			
		}
		break;
		case 24:
		case 25:
		case 26:
		case 27:
		{
			//set server or client mode
			
		}
		break;
		case 28:
		case 29:
		case 30:
		case 31:
		{
			//set uart baud
			
		}
		break;
		case 32:
		{
			//set local ipv6 ip
			ipv6_changed=true;
		}
		break;
		
	}
	if(ipv4_changed)
		set_if("e0",g_conf.local_ip,g_conf.sub_msk,g_conf.gw);
	if(ipv6_changed)
		set_if6("e0",g_conf.local_ip6);
	print_config();
}
void common_rw_config(int dev)
{

	static rt_uint8_t buf[65];
	rt_uint8_t i=0;
	static int data_len,crc_len,longlen=0;
	static unsigned char crc[2];
	char ch;	
	static rt_uint8_t len=0,param;
	static enum STATE_OP state=GET_F5;
	DBG("enter common_rw_config\r\n");
	rt_uint8_t *ptr=(rt_uint8_t *)buf;
	while((rt_device_read(common_dev[dev], 0, &ch, 1) == 1))
	{
		if(ch==0xf5 && state==GET_F5)
		{
			DBG("GET_F5\n");
			state=GET_8A_8B;
		}
		else if(ch==0x8a && state==GET_8A_8B)
		{
			DBG("GET_8A\n");
			data_len=0;
			longlen=0;
			state=GET_DATA;
		}
		else if(ch==0x8b && state==GET_8A_8B)
		{
			DBG("GET_8B\n");
			break;
		}
		else if(state==GET_DATA)
		{	
			DBG("GET_DATA %2x\n",ch);
			*(ptr+data_len)=ch;
			if(data_len==0)
			{
				if(ch==0x0c || ch==0x0d || ch==0x0e || ch==0x20)
					state=GET_LEN;
 			}
			else
			{
				if(ch==0x26&&(data_len>longlen))
					state=GET_FA;
 			}
			
			data_len++;
		}
		else if(state==GET_LEN)
		{
			DBG("GET_LEN %2x\n",ch);
			longlen=ch;
			state=GET_DATA;
		}
		else if(ch==0xfa && state==GET_FA)
		{
			DBG("GET_FA\n");
			data_len--;
			crc_len=0;
			state=GET_CHECSUM;
		}
		else if(state==GET_CHECSUM)
		{
			if(crc_len!=2)
			{
				crc[crc_len++]=ch;
			}

			if(crc_len==2)
			{
				//verify checksum
				int verify=0xf5+0x8a+0xfa+0x26;
				rt_kprintf("command is \n");
				for(i=0;i<data_len;i++)
				{
					rt_kprintf("%2x ",ptr[i]);	
					verify+=ptr[i];
				}
				rt_kprintf("crc is %2x %2x\n",crc[0],crc[1]);
				if(verify!=(crc[0]<<8|crc[1]))
					rt_kprintf("verify crc error\n");
				else
				{
					rt_kprintf("Command OK\n");
					set_config(ptr);
				}
				state=GET_F5;
			}
		}
	}
#if 0
	while((rt_device_read(common_dev[dev], 0, &ch, 1) == 1))
	{
		DBG("%x ==> %d\r\n",ch,state);
		switch(state)
		{
			case GET_F5:
			{
				if(ch==0xf5)
				{
					DBG("Dev %d , 0XF5 Got\r\n",which_common_dev(common_dev,dev));
					state=GET_8A_8B;
				}
			}
			break;
			case GET_8A_8B:
			{
				if(ch==0x8a)
				{
					DBG("Dev %d , 0X8A Got\r\n",which_common_dev(common_dev,dev));
					state=GET_DATA;
					data_len=0;
				}
				else if(ch==0x8b)
				{
					/*send config data out*/
					unsigned char i,*ptr,*ptr1;
					int result=0;
					int devices=which_common_dev(common_dev,dev);
					DBG("Dev %d , 0X8B Got\r\n",devices);
					get_config[0]=0xf5;
					get_config[1]=0x8C;
					result=0xf5+0x8c+0x27+0xfa;
					for(i=0;i<4;i++)
						get_config[2+i]=(g_conf.local_ip>>(i*8))&0xff;
					for(i=0;i<2;i++)
						get_config[6+i]=g_conf.local_port[i];					
					for(i=0;i<4;i++)
						get_config[8+i]=g_conf.sub_msk[i];					
					for(i=0;i<4;i++)
						get_config[12+i]=g_conf.gw[i];
					for(i=0;i<6;i++)
						get_config[16+i]=g_conf.mac[i];
					switch(devices)
					{
						case 0:
							ptr=g_conf.remote_ip0;
							ptr1=g_conf.remote_port0;
							break;
						case 1:
							ptr=g_conf.remote_ip1;
							ptr1=g_conf.remote_port1;
							break;
						case 2:
							ptr=g_conf.remote_ip2;
							ptr1=g_conf.remote_port2;
							break;
						case 3:
							ptr=g_conf.remote_ip3;
							ptr1=g_conf.remote_port3;
							break;
													
					}
					
					for(i=0;i<4;i++)
						get_config[22+i]=ptr[i];					
					for(i=0;i<2;i++)
						get_config[26+i]=ptr1[i];
					get_config[28]=g_conf.protol[devices];
					get_config[29]=g_conf.server_mode[devices];
					get_config[30]=g_conf.common_baud[devices];					
					get_config[31]=0x27;
					get_config[32]=0xfa;
					for(i=2;i<31;i++)
						result=result+get_config[i];
					get_config[33]=(result&0xff00)>>8;
					get_config[34]=result&0xff;
					rt_device_write(dev,0,get_config,sizeof(get_config));
					for(i=0;i<sizeof(get_config);i++)
						DBG("==>%x \r\n",get_config[i]);
					state=GET_F5;
					print_config();
				}
				
			}
			break;
			case GET_DATA:
			{
				if(data_len==0)
				{
					param=ch;
					DBG("Dev %d , Command 0x%2x Got\r\n",which_common_dev(common_dev,dev),ch);
					if(ch==0||ch==2||ch==3||ch==5||ch==6||ch==7||ch==8)
						len=4;
					else if(ch==1||ch==9||ch==10||ch==11||ch==12)
						len=2;
					else if(ch==4)
						len=6;
					else if(ch==13||ch==14||ch==15)
						len=1;
				}
				else
					buf[data_len-1]=ch;

				if(data_len==len)
					state=GET_26;
				else
				{
					state=GET_DATA;
					data_len++;
				}
			}
			break;
			case GET_26:
			{
				if(ch==0x26)
				{
					DBG("Dev %d , 0X26 Got\r\n",which_common_dev(common_dev,dev));
					state=GET_FA;
				}
				else
					state=GET_F5;
			}
			break;
			case GET_FA:
			{
				if(ch==0xfa)
				{
					state=GET_CHECSUM;
					crc_len=0;
				}
				else
					state=GET_F5;
			}
			break;
			case GET_CHECSUM:
			{
				crc[crc_len]=ch;
				if(crc_len!=1)
					crc_len++;
				else
				{
					unsigned char *ptr;
					DBG("Dev %d , 0XFA Got\r\n",which_common_dev(common_dev,dev));
					int result=0xf5+0x8a+param+0x26+0xfa;
					for(i=0;i<len;i++)
						result=result+buf[i];
					if(result==(crc[0]<<8|crc[1]))
					{
						switch(param)
						{
							case 0://local ip		
								ptr=g_conf.local_ip;
							break;
							case 1://local port 	
								ptr=g_conf.local_port;
							break;
							case 2://sub msk		
								ptr=g_conf.sub_msk;
							break;
							case 3://gw ip		
								ptr=g_conf.gw;
							break;
							case 4://mac		
								ptr=g_conf.mac;
								DBG("to write mac\r\n");
							break;
							case 5://socket 0 ip		
							{
								if(which_common_dev(common_dev,dev)==0)
									ptr=g_conf.remote_ip0;	
								else if(which_common_dev(common_dev,dev)==1)
									ptr=g_conf.remote_ip1;
								else if(which_common_dev(common_dev,dev)==2)
									ptr=g_conf.remote_ip2;
								else
								{
									ptr=g_conf.remote_ip3;
									DBG("to write socket3 ip\r\n");
								}
							}
							break;
							case 9://socket 0 port										
							{
								if(which_common_dev(common_dev,dev)==0)
									ptr=g_conf.remote_port0;
								else if(which_common_dev(common_dev,dev)==1)
									ptr=g_conf.remote_port1;
								else if(which_common_dev(common_dev,dev)==2)
									ptr=g_conf.remote_port2;
								else
								{
									ptr=g_conf.remote_port3;
									DBG("to write socket3 port\r\n");
								}
							}
							break;									
							case 13://protol	
								i=which_common_dev(common_dev,dev);
								g_conf.protol[i]=buf[0];
							break;
							case 14://server or client mode
								i=which_common_dev(common_dev,dev);
								g_conf.server_mode[i]=buf[0];
							break;									
							case 15://socket common baud
							{

								struct serial_configure config;
								ptr=g_conf.common_baud+which_common_dev(common_dev,dev);
								i=which_common_dev(common_dev,dev);
								if(buf[0]==0)
									config.baud_rate = 115200;
								else if(buf[0]==1)
									config.baud_rate = 406800;
								else if(buf[0]==2)
									config.baud_rate = 921600;
								else if(buf[0]==3)
									config.baud_rate = 2000000;
								else if(buf[0]==4)
									config.baud_rate = 4000000;
								else if(buf[0]==5)
									config.baud_rate = 6000000;

								config.bit_order = BIT_ORDER_LSB;
								config.data_bits = DATA_BITS_8;
								config.parity	 = PARITY_NONE;
								config.stop_bits = STOP_BITS_1;
								config.invert	 = NRZ_NORMAL;
								config.bufsz	 = RT_SERIAL_RB_BUFSZ;
								rt_device_control(dev,RT_DEVICE_CTRL_CONFIG,&config);								
								g_conf.common_baud[i]=buf[0];
								//rt_kprintf("set common %d buf[%d] %d to %x baud\r\n",i,i,buf[0],config.baud_rate);
							}
							break;
							default:
								ptr=NULL;
						}
					if(ptr!=NULL && param!=13 &&param!=14 &&param!=15)
						for(i=0;i<len;i++)
						{
							ptr[i]=buf[i];
							DBG("set %d %d\r\n",ptr[i],buf[i]);
						}
					if(param==4)
						DBG("mac %x %x %x %x %x %x \r\n",g_conf.mac[0],g_conf.mac[1],g_conf.mac[2],g_conf.mac[3],g_conf.mac[4],g_conf.mac[5]);
				}
					else
						DBG("Dev %d , crc fault %x!=%x\r\n",which_common_dev(common_dev,dev),result,(crc[0]<<8)|crc[1]);
				state=GET_F5;
				}
			
