blueskycoco/rtt/bsp/tm4c129x/applications/con_common.c
			}
			break;
			default:
			{
				DBG("Invaild %x\r\n",ch);
				state=GET_F5;
			}
			break;
		}
	}
#endif
}
static bool flag_cnn[4]={false,false,false,false};
void all_cut()
{
	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);	
	MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0); 
	MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0); 
	flag_cnn[0]=false;
	flag_cnn[1]=false;
	flag_cnn[2]=false;
	flag_cnn[3]=false;
}
void cnn_out(int index,int level)
{
	
	rt_kprintf("dev %d , level %d, phy_link %d\n",index,level,phy_link);
	if(phy_link)
	{
		if(level&&(flag_cnn[index]==false))
			flag_cnn[index]=true;
		else if(!level&&(flag_cnn[index]==true))
			flag_cnn[index]=false;
		else
			return;
		switch(index)
		{
			case 0:
				if(level)
					MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,0);
				else
					MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);
				break;
			case 1:
				if(level)
					MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,GPIO_PIN_5);
				else
					MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0);	
				break;
			case 2:
				if(level)
					MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,GPIO_PIN_2);
				else
					MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0);	
				break;
			case 3:
				if(level)
				;//	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);
				else
				;//	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,0);	
				break;
			default:
				break;
		}
	}
	else
	{
		MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);	
		MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0);	
		MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0);	
		flag_cnn[0]=false;
		flag_cnn[1]=false;
		flag_cnn[2]=false;
		flag_cnn[3]=false;
		//MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,0);	
	}
}
int baud(int type)
{
	switch(type)
	{
		case 0:
			return 115200;
		case 1:
			return 460800;
		case 2:
			return 921600;
		case 3:
			return 1000000;
		case 4:
			return 2000000;
		case 5:
			return 4000000;
		case 6:
			return 6000000;
		}
	return 0;
}
void print_config()
{
	rt_kprintf("\n============================================================================>\n");
	rt_kprintf("local_ip %s\n",g_conf.local_ip);
	rt_kprintf("local_port0 %d\n",g_conf.local_port[0]);
	rt_kprintf("local_port1 %d\n",g_conf.local_port[1]);
	rt_kprintf("local_port2 %d\n",g_conf.local_port[2]);
	rt_kprintf("local_port3 %d\n",g_conf.local_port[3]);
	rt_kprintf("sub_msk %s\n",g_conf.sub_msk);
	rt_kprintf("gw %s\n",g_conf.gw);
	rt_kprintf("mac %s\n",g_conf.mac);
	rt_kprintf("remote_ip0 %s\n",g_conf.remote_ip[0]);
	rt_kprintf("remote_ip1 %s\n",g_conf.remote_ip[1]);
	rt_kprintf("remote_ip2 %s\n",g_conf.remote_ip[2]);
	rt_kprintf("remote_ip3 %s\n",g_conf.remote_ip[3]);
	rt_kprintf("remote_ip60 %s\n",g_conf.remote_ip6[0]);
	rt_kprintf("remote_ip61 %s\n",g_conf.remote_ip6[1]);
	rt_kprintf("remote_ip62 %s\n",g_conf.remote_ip6[2]);
	rt_kprintf("remote_ip63 %s\n",g_conf.remote_ip6[3]);
	rt_kprintf("remote_port0 %d\n",g_conf.remote_port[0]);
	rt_kprintf("remote_port1 %d\n",g_conf.remote_port[1]);
	rt_kprintf("remote_port2 %d\n",g_conf.remote_port[2]);
	rt_kprintf("remote_port3 %d\n",g_conf.remote_port[3]);
	rt_kprintf("IP socket0 %s socket1 %s socket2 %s socket3 %s\n",((g_conf.config[0]&0x01)==0)?"IPV4":"IPV6",((g_conf.config[1]&0x01)==0)?"IPV4":"IPV6",((g_conf.config[2]&0x01)==0)?"IPV4":"IPV6",((g_conf.config[3]&0x01)==0)?"IPV4":"IPV6");
	rt_kprintf("protol socket0 %s socket1 %s socket2 %s socket3 %s\n",((g_conf.config[0]&0x02)==0x02)?"TCP":"UDP",((g_conf.config[1]&0x02)==0x02)?"TCP":"UDP",((g_conf.config[2]&0x02)==0x02)?"TCP":"UDP",((g_conf.config[3]&0x02)==0x02)?"TCP":"UDP");
	rt_kprintf("mode socket0 %s socket1 %s socket2 %s socket3 %s\n",((g_conf.config[0]&0x04)==0x04)?"SERVER":"CLIENT",((g_conf.config[1]&0x04)==0x04)?"SERVER":"CLIENT",((g_conf.config[2]&0x04)==0x04)?"SERVER":"CLIENT",((g_conf.config[3]&0x04)==0x04)?"SERVER":"CLIENT");
	rt_kprintf("baud %d.%d.%d.%d\n",baud((g_conf.config[0]&0xf8)>>3),baud((g_conf.config[1]&0xf8)>>3),baud((g_conf.config[2]&0xf8)>>3),baud((g_conf.config[3]&0xf8)>>3));
	rt_kprintf("\n============================================================================>\n");
}
int common_w_socket(int dev)
{	
	int len;
	rt_uint8_t common_buf[1024],*ptr;
	ptr=common_buf;
	len=rt_device_read(common_dev[dev], 0, ptr, 1024);
	if(phy_link&&(len>0))
		rt_data_queue_push(&g_data_queue[dev*2], ptr, len, RT_WAITING_FOREVER);
	return 0;
}
static rt_err_t common_rx_ind(rt_device_t dev, rt_size_t size)
{
    /* release semaphore to let finsh thread rx data */
	//DBG("dev %d common_rx_ind %d\r\n",which_common_dev(common_dev,dev),size);
    rt_sem_release(&(rx_sem[which_common_dev(common_dev,dev)]));
    return RT_EOK;
}

void common_w(void* parameter)
{
	int dev=((int)parameter)/2;
	static int flag=0;
	DBG("common_w %d Enter\r\n",dev);
	while (1)
	{
		/* wait receive */
		if (rt_sem_take(&(rx_sem[dev]), RT_WAITING_FOREVER) != RT_EOK) continue;
		//DBG("to read in_low %d\r\n",ind_low(dev));
		if(ind[dev])
		{	
			DBG("dev %d in socket data flag %d\n",dev,flag);
			if(flag==1)
			{
				print_config();
				flag=0;
				socket_ctl(RT_TRUE);
			}
			
			/*socket data transfer,use dma*/
			common_w_socket(dev);
		}
		else
		{
			DBG("dev %d in config data flag %d\n",dev,flag);
			if(flag==0)
			{
				flag=1;
				/*config data parser*/
				socket_ctl(RT_FALSE);
			}
			common_rw_config(dev);
		}
	}
}
static void common_r(void* parameter)
{
    rt_size_t data_size;
    const void *last_data_ptr;
	int dev=(int)parameter;
	while(1)
	{
		rt_data_queue_pop(&g_data_queue[dev], &last_data_ptr, &data_size, RT_WAITING_FOREVER);
		if(data_size!=0 && last_data_ptr)
		{			
			rt_device_write(common_dev[(dev-1)/2], 0, last_data_ptr, data_size);
		}
	}
}

/*init common1,2,3,4 for 4 socket*/
int common_init(int dev)//0 uart , 1 parallel bus, 2 usb
{
	/*init common device*/
	rt_err_t result;
	rt_uint8_t common[10];
	int i;
	/*read config data from internal flash*/
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOK);
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);

